export function choiseSetOfExercise(gen, cat, ag) {
    if ((gen === 'Женский' && cat === 1 && (ag === '45 - 49' || ag === '50 и старше') ) ||
        (gen === 'Женский' && cat === 2 && (ag === '45 - 49' || ag === '50 и старше') ) ||
        (gen === 'Женский' && cat === 3 && (ag === '45 - 49' || ag === '50 и старше') ) || 
        (gen === 'Мужской' && cat === 1 && (ag === '50 - 54' || ag === '55 - 59' || ag === '60 и старше') ) || 
        (gen === 'Мужской' && cat === 2 && (ag === '50 - 54' || ag === '55 - 59' || ag === '60 и старше') ) ||
        (gen === 'Мужской' && cat === 3 && (ag === '50 - 54' || ag === '55 - 59' || ag === '60 и старше') )){
        return     [
            // 1 группа
            ['сила', 'быстрота', 'ловкость'],
            ['выносливость']
          ]
    }
    if ((gen === 'Женский' && cat === 1 && (ag === '40 - 44' || ag === '35 - 39' || ag === '30 - 34' || ag === '25 - 29' || ag === 'до 25') ) ||
        (gen === 'Женский' && cat === 2 && (ag === '40 - 44' || ag === '35 - 39' || ag === '30 - 34' || ag === '25 - 29' || ag === 'до 25') ) ||
        (gen === 'Женский' && cat === 3 && (ag === '40 - 44' || ag === '35 - 39' || ag === '30 - 34' || ag === '25 - 29' || ag === 'до 25') ) || 
        (gen === 'Мужской' && cat === 3 && (ag === '45 - 49' || ag === '40 - 44' || ag === '35 - 39' || ag === '30 - 34' || ag === '25 - 29' || ag === 'до 25' ) ) ||
        (gen === 'Женский' && cat === 'Курсанты 1 курса') ||
        (gen === 'Женский' && cat === 'Курсанты 2 курса') ||
        (gen === 'Женский' && cat === 'Курсанты 3 - 5 курсов') ){
        return     [
            // 2 группа
            ['сила'],
            ['быстрота', 'ловкость'],
            ['выносливость']
          ]
    }
    if (gen === 'Мужской' && cat === 2 && (ag === '45 - 49' || ag === '40 - 44' || ag === '35 - 39' || ag === '30 - 34' || ag === '25 - 29' || ag === 'до 25' ) ){
        return     [
            // 3 группа
            ['сила', 'быстрота', 'ловкость'],
            ['сила', 'выносливость'],
            ['СФУ']
          ]
    }
    if (gen === 'Мужской' && cat === 1 && (ag === '45 - 49' || ag === '40 - 44' || ag === '35 - 39' || ag === '30 - 34' || ag === '25 - 29' || ag === 'до 25' ) ){
        return     [
            // 4 группа
            ['сила', 'быстрота', 'ловкость'],
            ['сила', 'выносливость'],
            ['СФУ'],
            ['СФУ']
          ]
    }
    if (gen === 'Мужской' && cat === 'Курсанты 1 курса'){
        return     [
            // 5 группа курсанты 1 курса
            ['быстрота', 'ловкость'],
            ['сила'],
            ['выносливость'],
            ['СФУ']
          ]
    }
    if ((gen === 'Мужской' && cat === 'Курсанты 2 курса')||
        (gen === 'Мужской' && cat === 'Курсанты 3 - 5 курсов') 
        ){
        return     [
            // 6 группа курсанты 2 курса и последующих курсов
            ['быстрота', 'выносливость'],
            ['сила'],
            ['ловкость'],
            ['СФУ'],
            ['СФУ']
        ]
    }
}